{
  "title": "Fight System",
  "paragraph": "Fights are a core concept of the game. In a fight the player with the higher strength always wins. The basis of strength is the attack and defense value of the units which then can be increased with various buffs.",
  "chapters": [
    {
      "subtitle": "Attack & Defense",
      "dynamicContents": [
        {
          "type": "text",
          "content": "Each unit has an attack and a defense value. Units with a high attack but low defense value are often called \"offensive units\" and units with a high defense but low attack value are called \"defensive units\". Of course it's more efficient to use offensive units to attack and defensive units to defend, but it's possible to attack or defend with each unit."
        },
        {
          "type": "text",
          "content": "In a fight, the strength of a unit depends on whether it is attacking or defending. For a attacking unit the strength of this unit is equal to their attack value. The defense value is irrelevant. And in defense only defensive value counts."
        },
        {
          "type": "heading",
          "content": "Example"
        },
        {
          "type": "text",
          "content": "10 {{ Nyxis # article/units/nyxi }} (att: 50, def: 20) attack 10 {{ Grass Spirits # article/units/grass-spirit }} (att: 20, def: 40)."
        },
        {
          "type": "text",
          "content": "Because the Nyxis are attacking, take the attack value to calculate the strength of the attack:\n<div style=\"text-indent:20px;\">10 * 50 = <strong>500</strong> <i>(amount of units * attack value = strength)</i></div>"
        },
        {
          "type": "text",
          "content": "For the defending Grass Spirits, take the defensive value to calculate the strength of the defense:\n<div style=\"text-indent:20px;\">10 * 40 = <strong>400</strong></div>"
        },
        {
          "type": "text",
          "content": "In this example without any other buffs the attacker would win the fight because his strength is greater than the strength of the defender."
        }
      ]
    },
    {
      "subtitle": "Buffs",
      "dynamicContents": [
        {
          "type": "text",
          "content": "There are multiple ways to increase the strength of your attacking or defending units. Some buffs apply for the whole army, some buffs only for a specific unit. The buffs you can get are:"
        },
        {
          "type": "list",
          "content": [
            "Effectiveness buff",
            "Local skill tree",
            "Local field buff",
            "Runes",
            "Special unit runes",
            "Artifacts"
          ]
        },
        {
          "type": "heading",
          "content": "Effectiveness Buff"
        },
        {
          "type": "text",
          "content": "Units can increase their strength up to 100% when they fight against units they are effective against (no matter whether attacking or defending). This buff applies to every unit type individual. Check out the {{ effectiveness system # article/systems/effectiveness }} for more details."
        },
        {
          "type": "heading",
          "content": "Local Skill Tree"
        },
        {
          "type": "text",
          "content": "Each basic field has a {{ local skill tree # article/systems/skill-tree }} with offensive and defensive skills. Offensive skills are only considered when attacking from that field and defensive skills only when this field gets attacked (e.g. the defensive skill \"healing\" won't be applied on attacks)."
        },
        {
          "type": "text",
          "content": "Buffs from the local skill tree always apply to every unit in this field. If you activate the offensive skill \"Battle Force\" the strength of attacking units will be 30% higher. Multiple buffs are counted additive, which allows you to attack with an attack buff of +100% (double your strength)."
        },
        {
          "type": "heading",
          "content": "Local Field Buff"
        },
        {
          "type": "text",
          "content": "Some fields have one or multiple field buffs which can increase your attack or defense. Check out the article about {{ Field Buffs # article/fields/field-buffs }} to see the different buffs. Field buffs boost always the whole army and are counted additive to other buffs."
        },
        {
          "type": "heading",
          "content": "Runes & Artifacts"
        },
        {
          "type": "text",
          "content": "{{ Runes # article/systems/runes }} and {{ artifacts # article/fields/artifact }} increase the strength too. Like the skill tree and field buffs, they are added additive to other buffs and buff the whole army. Offensive runes and artifacts apply to attacks only, while defensive runes and artifacts only apply in defense."
        },
        {
          "type": "heading",
          "content": "Special Units"
        },
        {
          "type": "text",
          "content": "Special units have their own abilities which can increase the attacking or defending strength. Some of the abilities boost the whole army and other abilities only apply to the special unit."
        }
      ]
    },
    {
      "subtitle": "Example",
      "dynamicContents": [
        {
          "type": "columnTable",
          "content": {
            "rowHeaders": [
              "units",
              "buffs"
            ],
            "columnHeaders": [
              "Attacker",
              "Defender"
            ],
            "columns": [
              [
                "100x Guard Naki,\n50x Druid Naki",
                "15x Elder Spirit,\n200x Nyxi"
              ],
              [
                "100% skill tree \n6% runes",
                "30% skill tree,\n10% field buff,\n40% healing"
              ]
            ]
          }
        },
        {
          "type": "text",
          "content": "\nTo find out who wins the fight the raw strength is calculated first. For each unit, the corresponding value (att value for attackers, def value for defenders) is calculated with the amount of this unit. To calculate the effectiveness buff, multiply the percentage of the unit type with the percentage of enemy troops the unit is effective against (more details {{ here # article/systems/effectiveness }})."
        },
        {
          "type": "text",
          "content": "For each unit add the buffs to the raw strength to get the actual strength for this fight. The army with the higher total strength wins the fight!"
        },
        {
          "type": "heading",
          "content": "Attacker"
        },
        {
          "type": "table",
          "content": {
            "header": [
              "Name",
              "Amount",
              "Att",
              "Def",
              "raw Strength",
              "% of total army",
              "effective buff",
              "other buffs",
              "total Strength"
            ],
            "rows": [
              [
                "Guard Naki",
                "100",
                "100",
                "50",
                "10'000",
                "89%",
                "79%",
                "106%",
                "28'500"
              ],
              [
                "Druid Naki",
                "50",
                "25",
                "25",
                "1'250",
                "11%",
                "79%",
                "106%",
                "3'563"
              ],
              [
                "<strong>total</strong>",
                "<strong>150</strong>",
                "-",
                "-",
                "<strong>11'250</strong>",
                "<strong>100%</strong>",
                "<strong>79%</strong>",
                "<strong>106%</strong>",
                "<strong>32'063</strong>"
              ]
            ]
          }
        },
        {
          "type": "text",
          "content": ""
        },
        {
          "type": "heading",
          "content": "Defender"
        },
        {
          "type": "table",
          "content": {
            "header": [
              "Name",
              "Amount",
              "Att",
              "Def",
              "raw Strength",
              "% of total army",
              "effective buff",
              "other buffs",
              "total Strength"
            ],
            "rows": [
              [
                "Elder Spirit",
                "15",
                "100",
                "1000",
                "15'000",
                "79%",
                "0%",
                "40%",
                "21'000"
              ],
              [
                "Nyxi",
                "200",
                "50",
                "20",
                "4'000",
                "21%",
                "100%",
                "40%",
                "9'600"
              ],
              [
                "<strong>total</strong>",
                "<strong>215</strong>",
                "-",
                "-",
                "<strong>19'000</strong>",
                "<strong>100%</strong>",
                "<strong>21%</strong>",
                "<strong>40%</strong>",
                "<strong>30'590</strong>"
              ]
            ]
          }
        },
        {
          "type": "text",
          "content": "\nIn this fight, the defender has more raw strength than the attacker (19'000>11'250). But because of the higher buffs, the attacker's total strength grows bigger than the strength of the defender (30'314>28'280). Therefore, <strong>the attacker wins the fight</strong>. The healing buff of the defender doesn't count because it heals units after the defender wins the fight, but has no direct impact on the fight itself."
        },
        {
          "type": "text",
          "content": "If you want to simulate a fight and want to know how many units survive, then checkout the {{ fight simulator # fight-simulator }}."
        }
      ]
    },
    {
      "subtitle": "Tips & Tricks",
      "dynamicContents": [
        {
          "type": "heading",
          "content": "Skill tree"
        },
        {
          "type": "text",
          "content": "As mentioned, each basic field has a local skill tree. Always use the full offensive skills when you attack. You can double your attack strength with those skills!. But don't forget to change the skills after the attack back to production boost or in case you get attacked defensive buffs."
        },
        {
          "type": "text",
          "content": "When you get attacked use the right defensive buffs. If you are confident that you win the fight, the heal buffs are very powerful. But if you lose, the heal buff does nothing and you better take the defensive buffs to make your defense stronger. Especially the skill \"modified Plague\" is recommended in case you get attacked while you aren't prepared."
        },
        {
          "type": "heading",
          "content": "Effective units"
        },
        {
          "type": "text",
          "content": "Use effective units can make a huge difference in fights. It's worth sending some {{ Spotter Nakis # article/units/spotter-naki }} first, to know which units the defender has.  And when you have to defend but know with which unit type the attacker is on the way, it can be worth moving not effective units away, that the remaining units can defend with a higher buff."
        }
      ]
    }
  ]
}