{
  "title": "Teryx",
  "paragraph": "One of three special units that can be unlocked. Every special unit has a unique core ability who defines this unit. Unlike normal units, a special unit has a own skill tree to improve their core ability and learn additional abilities. \n Teryx is offensively oriented and benefits from his agility. ",
  "image": "Teryx.png",
  "chapters": [
    {
      "subtitle": "Teryx Stats",
      "image": "",
      "dynamicContents": [
        {
          "type": "text",
          "content": "Attack: {{ units.teryx.attack }} \n Defense: {{ units.teryx.defense }} \n Speed: {{ units.teryx.speed }} \n Recruitment time: {{ units.teryx.recSpeed }}"
        }
      ]
    },
    {
      "subtitle": "Skill Tree",
      "dynamicContents": [
        {
          "type": "text",
          "content": "Every special unit has there own unique skill tree to improve their strength and learn new abilities. The first three upgrades improve the core feature of the special unit. After that, the special unit can learn 2 out of 4 unique abilities and also upgrade each ability separately. If one ability is chosen, the other ability next to it gets locked."
        },
        {
          "type": "text",
          "content": "<b>Core feature </b> \n 1: Teryx can attack over a distance of up to 3 fields \n 2: Teryx can attack over a distance of up to 4 fields \n 3: Teryx can attack over a distance of up to 5 fields"
        },
        {
          "type": "text",
          "content": "<b>Escape</b> \n When an attack consists of only Teryx, they will try their best to estimate whether a win against the defending army is possible. If the enemy army at least 100% stronger (50% stronger/any stronger)  than them, all Teryx will abort the attack and escape back home."
        },
        {
          "type": "text",
          "content": "Flight Trap \n If a field containing Teryx gets attacked, Teryx will hide and launch a counter attack immediately after the attack arrived. Teryx receive a +25% (+50%/+100%) Atk Buff for this counter attack"
        },
        {
          "type": "text",
          "content": "Radial Impact \n Teryx gain additional momentum when attacking at maximum distance, causing them to gain +50% (+100%/+200%) attack power."
        },
        {
          "type": "text",
          "content": "Swarming \n The individual attack of Teryx increases to a low (medium/high) degree as the number of Teryx in an attack increases."
        }
      ]
    },
    {
      "subtitle": "Teryx Hero",
      "dynamicContents": [
        {
          "type": "text",
          "content": "After unlocking all upgrades of at least one ability the Teryx hero gets unlockable. The hero unit is a much stronger version of the Teryx. The hero unit also has the upgraded base ability,but does not learn the additional abilities of the Teryx. He can be summoned on a control field and, if he dies, be resurrected there after a certain amount of time. After unlocking the hero unit, the attack value of the Teryx and the Teryx hero can be increased by +50% (+100%)."

        }
      ]
    }
  ]
}